## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |              NAME               |
|--------|---------------------------------|
| add    | `aws_ssm_parameter.mongodb_uri` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_ssm_parameter.mongodb_uri will be created
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_ssm_parameter" "mongodb_uri" {
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn            = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + data_type      = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + insecure_value = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + key_id         = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name           = "mongodb_uri"
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all       = {
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tier           = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type           = "SecureString"
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + value          = (sensitive value)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + version        = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 1 to add, 0 to change, 0 to destroy.
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + mongodb_uri_arn     = (known after apply)
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m12:50:49.462[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m12:50:49.463[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m12:50:49.463[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.mongodb_uri"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.openai_api_key"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
